{
  "title": "Committees",
  "subtitle": "",
  "content": "<div class=\"bio\">\n<div class=\"paragr\">\n\n## 12th Man\n\n<!--StartFragment-->\n\nHowdy! We are Alanna Strittmatter and Dylan Brunner, but most importantly we are the co-loudest, co-proudest, co-chairs of the 12th man Committee. Our jobs are camping out for ticket pulls for the home football games, making intramural teams, picking the game of the week, hosting tailgates for Feast, and organizing Good-Bull nights. We can’t wait to get our 10 perfect freshmen! \n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n<﻿/div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Functions\n\n<!--StartFragment-->\n\nHowdy! We are Chelsea Hull and Jackson Hurd, and we are the co-loudest, co- proudest co-chairs of the feast functions committee! As the function’s committee, we are responsible for helping our freshmen plan and put on all social events for FEAST throughout the year. Our goal as functions co-chairs is to provide opportunities for freshmen to make meaningful relationships and have so much fun at holiday socials, parties and formals!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Fundraising\n\n<!--StartFragment-->\n\nHowdy! We’re Olivia Vaughn and Cooper Stanford and we’re the co-loudest and co-proudest co-chairs of Feast Staff ‘28 Fundraising Committee. We manage funds for the rest of the organization, by holding profit shares, and other various fundraising events. We organize Committee Olympics to encourage heavy competition between all seven committees.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Leadership\n\n<!--StartFragment-->\n\nc﻿oming soon!\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Outreach\n\n<!--StartFragment-->\n\nHOWDY! We are JuanMarcos Palomo and Peyton Yon and we are the co-loudest and co-proudest co-chairs of FEAST OUTREACH! Our job as the Outreach committee chairs is to help our FEAST freshman connect with freshmen from other FLOs, as we will be setting up Co-FLO events throughout the year. We also are responsible for finding guest speakers from other organizations to talk at our weekly meetings in order to inform the freshman of events occurring outside of FEAST. Lastly, we are also responsible for setting up an All-FLO event that will take place during the 2nd semester. We are so excited to meet our 10 perfect Outreach freshmen. Throw the O! \n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Promo\n\n<!--StartFragment-->\n\nc﻿oming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Service League\n\n<!--StartFragment-->\n\nHowdy! We are Alex Molnar and Emery Selner, the co-loudest and co-proudest co-chairs of the Service League committee aka Sleag! As the Sleag committee we are responsible for street cleanups, service retreat, and planning philanthropy events for throughout the year! We can’t wait to create meaningful friendships with the Class of ‘28 through acts of service. This year we hope to give freshmen the opportunity to be involved in Aggie traditions, serve the BCS community, and find their place here at Texas A&M!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>"
}