{
  "title": "Committees",
  "subtitle": "",
  "content": "<div class=\"bio\">\n<div class=\"paragr\">\n\n## Functions\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Fundraising\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Promo\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Service League\n\n<!--StartFragment-->\n\n HOWDY!!!! Our names are Evan Lee and Kenna Zeller and we are so so so incredibly excited and grateful for the chance to be the Sleag Co-Chairs for the Class of ‘27. Although, more importantly we are the loudest and the proudest members of the fighting Texas Aggie Class of ‘26 A-A-A-A-A!  We will be in charge of street cleanups, service retreat, and planning a philanthropy event in the spring. We can't wait to create meaningful friendships with the Class of ‘27 through acts of service. This year we hope to give freshmen the opportunity to be involved in Aggie tradition as well as help them find their place at A&M!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Leadership\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## 12th Man\n\n<!--StartFragment-->\n\nHowdy! We are Chloe and Kalen, but most importantly we are the co-loudest, co-proudest, co-chairs of the 12th man Committee. Our jobs are camping out for ticket pulls for the home football games, making intramural teams, picking the game of the week, hosting two tailgates for Feast, and organizing Good-Bull nights.  We are hoping to go back to back champions of Committee Olympics, but more importantly we are hoping for a close group of Freshman that will support and help each other.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Outreach\n\n<!--StartFragment-->\n\nHowdy, we are Tyler Yates and Grace Le and we are the Co-Loudest and Co-Proudest members of the Outreach Committee. Our job as the Outreach committee chairs is to help our FEAST freshman connect with freshmen from other FLOs, as we will be setting up Co-FLO events throughout the year. We also are responsible for finding guest speakers from other organizations to talk at our weekly meetings in order to inform the freshman of events occurring outside of FEAST. Lastly, we are also responsible for setting up an All-FLO event that will take place during the 2nd semester. We are so excited to meet our 10 perfect Outreach freshmen. Throw the O!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>"
}