{
  "title": "Our Staff",
  "content": "<div class=\"bio\">\n<div class=\"paragr\">\n\n## Bobby Boyd -- Executive Director\n\nHowdy! My name is Bobby Boyd, and I am a junior Finance major from Frisco, Texas. When I am not playing golf or selling stocks, I try to stay active by hunting, fishing, or playing intramural sports (pro spikeball player). I also enjoy country music and talking about both Aggie and professional sports! FEAST has taught me so much about Texas A&M and I can't wait to impact the class of 2026!\n\n</div>\n\n![](/images/uploads/img_5291.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Logan Sandidge -- Director of Communication and Administration\n\nMy name is Logan Sandidge, and I’m a junior Mechanical Engineering major from Boerne, Texas. I like to ski, golf, and swim; I LOVE Aggie sports (especially football) and my favorite place in the world is Kyle field. When I’m not playing intramural sports or attempting to raise animals (ask about my fish and chickens) I like to make midnight drives to Buccees. FEAST taught me a ton about Aggie traditions and I can’t wait to share that with the class of 2026!\n\n</div>\n\n![](/images/uploads/img_5289.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Mac McCulla -- Director of Engagement\n\nH﻿owdy! My name is Mac McCulla, and I am a junior Construction Science major from New Orleans, Louisiana. Besides trying to obtain the physique of a Greek god, I enjoy golfing, thrifting, and being outdoors. When I am not cheering on the Aggies, I enjoy watching the two greatest sports teams of all time, the New Orleans Saints and New Orleans Pelicans. FEAST has been the best decision I have made and has allowed me to find my home at Texas A&M. I am excited to welcome the Class of 2026!\n\n</div>\n\n![](/images/uploads/img_5287.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Gabi Harvatin -- Director of Finance\n\n</div>\n\n![](/images/uploads/img_5284.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Sydney McCorkle -- Director of Marketing\n\nHey y’all!! My name is Sydney McCorkle, and I am a junior Accounting major from College Station, TX (yes I’m from here)!! Most of the time you’ll find me buying things I don’t need online, working out, or watching Alisha Marie and Kenzie Elizabeth on YouTube!! FEAST really encouraged me to participate and understand the many traditions that A&M has and I can’t wait to share them with the class of 2026!!\n\n</div>\n\n![](/images/uploads/img_5286.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Braylee Kelly -- Functions\n\nHowdy! My name is Braylee Kelly, and I am a sophomore Finance major from Flower Mound, Texas; but more importantly, I am the LOUDEST and the PROUDEST member of the Fightin' Texas Aggie Class of 2025 (A-A-A-A-A!). I love adventures, trying new things, cooking, a variety of intramural sports, and Aggie athletics. FEAST helped me learn about all the traditions that A&M has to offer and it gave me friends to experience them with!\n\n</div>\n\n![](/images/uploads/tmp-14-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Michael Morse -- Functions\n\nHowdy! My name is Michael Morse, and I am a sophomore Mechanical Engineering major from Houston, Texas; but more importantly, I am the LOUDEST and the PROUDEST member of the Fightin' Texas Aggie Class of 2025 (A-A-A-A-A!). In my free time, you can catch me playing intramural sports with FEAST, jamming out on the saxophone (careless whisperer), or going to tons of Aggie sporting events. The spirit traditions are what make A&M special, and I am so pumped to share them with the class of 2026!\n\n</div>\n\n![](/images/uploads/tmp-19-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Kiley Coats -- Fundraising\n\nHowdy! My name is Kiley Coats, and I am a sophomore Sport Management major from Waco, Texas; but more importantly, I am the LOUDEST and the PROUDEST member of the Fightin' Texas Aggie Class of 2025 (A-A-A-A-A!). A few things about me: I love Dr. Pepper, Freebirds (better than Chipotle), and Texas A&M football! A few of my favorite things are Buc-ees runs, lake trips, Flatland Calvary, and spending time with friends! I am beyond excited to spread the Aggie spirit and make long lasting memories with the class of 2026!\n\n</div>\n\n![](/images/uploads/tmp-16-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Luke Bland -- Fundraising\n\nHowdy! My name is Michael Morse, and I am a sophomore Business Management major from Odessa, Texas; but more importantly, I am the LOUDEST and the PROUDEST member of the Fightin' Texas Aggie Class of 2025 (A-A-A-A-A!). Some things I enjoy are working out, hanging out with friends, and driving around and listening to music (my music is unmatched)! I can't wait for the class of 2026!\n\n</div>\n\n![](/images/uploads/tmp-18-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Lauren Abler -- 12th Man\n\nHowdy! My name is Lauren Abler, and I am a sophomore Mechanical Engineering major from Kingwood, Texas; but more importantly, I am the LOUDEST and the PROUDEST member of the Fightin' Texas Aggie Class of 2025 (A-A-A-A-A!). I love playing and watching all sports, listening to music, and I love sonic runs. As a first generation Aggie, FEAST taught me so much about all the traditions A&M has and allowed me to make so many great friends. I am so excited for this coming year and I can't wait to share this experience with the class of 2026!\n\n</div>\n\n![](/images/uploads/tmp-24-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Courtland Barnett -- 12th Man\n\nHowdy! My name is Courtland Barnett, and I am a sophomore Industrial Engineering major from Plano, Texas; but more importantly, I am the LOUDEST and the PROUDEST member of the Fightin' Texas Aggie Class of 2025 (A-A-A-A-A!). I love to play sports, ride my bike, smell candles, and work out! I can't wait to spend this year introducing traditions and getting to know the class of 2026!\n\n</div>\n\n![](/images/uploads/tmp-21-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Caitlyn Coker -- Outreach\n\n</div>\n\n![](/images/uploads/tmp-27-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Henry Pearson -- Outreach\n\n</div>\n\n![](/images/uploads/tmp-26-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Sydney Gowan -- Service League\n\nHowdy! My name is Sydney Gowan, and I am a sophomore Agriculture Leadership and Development major from Frisco, Texas; but more importantly, I am the LOUDEST and the PROUDEST member of the Fightin' Texas Aggie Class of 2025 (A-A-A-A-A!). In my spare time, I enjoy spending time with family and friends, eating Mexican food, doing fitness classes at the rec center, and watching football (Go Aggies and Cowboys!) I am super excited to get to know the Fightin' Texas Aggie Class of 2026!\n\n</div>\n\n![](/images/uploads/tmp-25-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Gabe Patterson -- Service League\n\nHowdy! My name is Gabe Patterson, and I am a sophomore Architectural Engineering major from Richardson, Texas; but more importantly, I am the LOUDEST and the PROUDEST member of the Fightin' Texas Aggie Class of 2025 (A-A-A-A-A!). In my free time, I enjoy playing tennis, hiking, and watching movies. I can't wait to see how FEAST impacts the class of 2026!\n\n</div>\n\n![](/images/uploads/tmp-29-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Isabelle Smith -- Leadership\n\n</div>\n\n![](/images/uploads/tmp-22-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Ethan Lee -- Leadership\n\n</div>\n\n![](/images/uploads/tmp-20-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Abby North -- Promo\n\n</div>\n\n![](/images/uploads/tmp-28-.jpg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Kiran Kagal -- Promo\n\n</div>\n\n![](/images/uploads/tmp-15-.jpg)\n\n</div>"
}