{
  "title": "Our Staff",
  "content": "<div class=\"bio\">\n<div class=\"paragr\">\n\n## Landry Langley - Executive Director\n\n<!--StartFragment-->\n\nHowdy! My name is Sydney Gowan and I am a Junior Agriculture Leadership and Agriculture Communications double major from Frisco, Texas. But most importantly I am the loudest and proudest member of the Fightin’ Texas Aggie Class of 2025 (A-A-A Whoop). In my spare time, I love spending time with my family/friends, watching Aggie sports, and working out. My favorite tradition is the 12th Man. I believe that the 12th Man is an intrical part of the atmosphere created at sporting events. Nothing compares to the energy present during a sold out football game in Kyle Field.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## K﻿iley Coats - Director of Engagement\n\n<!--StartFragment-->\n\nHowdy! My name is Kiley Coats and I am a Sport Management major with a Pre Law minor from Waco, Texas. But more importantly I am the loudest and the proudest member of the Fightin’ Texas Aggie class of 2025 (A-A-A Whoop!) If I’m not at a FEAST event you can find me reading, driving to bucees with country music on full blast, or watching Aggie sports. My favorite tradition is midnight yell. Nothing quite compares to thousands of college students giving up their Friday night to come stand and support each other and the football team.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Luke  Bland - Director of Finance\n\n<!--StartFragment-->\n\nHowdy! My name is Luke Bland and I am a business management pre law major from Odessa, Texas, but most importantly I am the loudest and proudest member of the fightin’ Texas Aggie Class of 2025(A-A-A Whoop) in my free time I love to workout, go outside, and hang out with friends. My favorite tradition here at Texas A&M is The Aggie Bonfire memorial.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Isabelle Smith - Director of Marketing\n\n<!--StartFragment-->\n\nHowdy! My name is Isabelle Smith and I am a Business Management Major from Richardson, Texas, but more importantly I am the loudest and the proudest member of the fighting Texas Aggie Class of 2025 (AAA WHOOP)! I love hiking, going to concerts and eating ice cream! My favorite tradition at Texas A&M is Muster. It is so inspiring to experience the Aggie Community come together and remember fellow Aggies from all around the world.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Chloe Dang - 12th Man\n\n<!--StartFragment-->\n\nHowdy my name is Grace Le and I am a Sophomore Neuroscience major from Plano, Texas, but most importantly I am the loudest and proudest member of the Fighting Texas Aggie Class of 2026. My favorite hobbies include playing sports like pickleball and volleyball, late night study sessions at Evans library, and trying out new food. Go check out my food review instagram account @goodlookineatss. My favorite tradition here at A&M would have to be Silver Taps because I love the idea of honoring the fallen Aggies of the month and being able to support their friends and family.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Kalen Hull - 12th Man\n\n<!--StartFragment-->\n\nHowdy! My name is Kalen Hull and I am an Industrial Systems Major from Austin, Texas, but most importantly I am the loudest, the proudest, member of the Fighting Texas Aggie Class of 2026. AY-AY-AY-AY-AY. In my free time I enjoy hunting, fishing, and hanging out with friends. My favorite artist right now is Zach Bryan and I am so excited for his new album. My favorite tradition is Fish Camp because it is so much fun and very informative.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Allison Boyd - Functions\n\n<!--StartFragment-->\n\nHowdy my name is Allison Boyd and I am a sophomore biomedical science major from Frisco, Texas! I absolutely love getting involved in all things Texas A&M, whether that be attending sporting events, playing intramurals, or partaking in any/all traditions. In my free time I enjoy baking, working out, playing sports and finding cute coffee shops. My favorite Texas A&M tradition is Midnight Yell the night before all home football games because it is a time to get super excited and ready for the next day’s game with your friends!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Andrew Parker - Functions\n\n<!--StartFragment-->\n\nHowdy my name is Andrew Parker, I am a sophomore engineering major from Plano Texas, but more importantly I am the loudest and the proudest member of the fightin’ Texas Aggie class of 2026! I am a big fan of Texas A&M sports and most importantly I am very passionate about Texas A&M traditions on campus. My favorite tradition I participate in is standing for the entirety of every football game. I make it my goal to go to every single home football game and stand for my fellow Aggies. I am a very big sports fan so I also try to go to as many other aggie sporting events as possible as well as participating in as many intramural sports that I possibly can!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Ella Sanders - Fundraising\n\n<!--StartFragment-->\n\nHowdy! I’m Ella Sanders and I am a sophomore Allied Health major from Dallas, Texas, but most importantly I am the loudest and the proudest member of the fighting Texas Aggie Class of 2026 (A-A-A-A-A)! In my free time, I enjoy hanging out with my friends, doing arts and crafts, and watching football. My favorite Texas A&M tradition is the 12th Man, because they create an incredible energy around campus, and especially at sporting events.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## David Rose - Fundraising\n\n<!--StartFragment-->\n\nHowdy! My name is David Rose, I am a sophomore Mechanical Engineering major from Southlake, Texas but most importantly I am the loudest and the proudest member of the fighting Texas Aggie Class of 2026 (A-A-A-A-A). In my free time, I enjoy working out, playing intramural sports, and watching Sam Sulek. My favorite Texas A&M tradition is Silver Taps as I believe it's a great way to pay respect for fellow Aggies that passed away on the first Tuesday of every month.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## L﻿andry Langley - Leadership\n\n<!--StartFragment-->\n\nHowdy! My name is Landry Landry and I am a sophomore Animal Science major from Palestine, Texas. But most importantly I am the loudest and proudest member of the Fighting Texas Aggie Class of 2026 A-A-A-A-A! In my free time I enjoy spending time with friends, attending any Texas A&M sports event, and random car rides with friends. My favorite A&M tradition is Aggie Bonfire. Paying respect to the lives lost and supporting each other because we are the Aggie family.  I also love everything Aggie Spirit!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## O﻿liver Kennedy - Leadership\n\n<!--StartFragment-->\n\nHowdy! My name is Oliver Kennedy and I am an industrial distribution major from Sugar Land, TX. But most importantly I am the loudest and the proudest member of the fighting texas aggie class of 2026 A-A-A-A-A! In my free time I enjoy fishing, participating in intramurals, playing basketball at the rec, and watching all the A&M sporting events. My favorite A&M tradition is aggie muster and how we honor all the aggies who have passed away within the past year. I find it meaningful how we remember all of our aggies graduated or not.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## G﻿race Le - Outreach\n\n<!--StartFragment-->\n\nHowdy my name is Grace Le and I am a Sophomore Neuroscience major from Plano, Texas, but most importantly I am the loudest and proudest member of the Fighting Texas Aggie Class of 2026. My favorite hobbies include playing sports like pickleball and volleyball, late night study sessions at Evans library, and trying out new food. Go check out my food review instagram account @goodlookineatss. My favorite tradition here at A&M would have to be Silver Taps because I love the idea of honoring the fallen Aggies of the month and being able to support their friends and family.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Tyler Yates - Outreach\n\n<!--StartFragment-->\n\nHowdy, my name is Tyler Yates and I am a Sophomore Civil Engineering major from Missouri City, Texas, but most importantly I am the loudest and proudest member of the Fighting Texas Aggie Class of 2026. In my free time I enjoy doing anything outdoors, watching/playing anything sports related, and hanging out with my friends. My favorite Texas A&M tradition would definitely have to be Fish Camp, as it helped introduce me to the Aggie Family and allowed me to connect to my first friends here at A&M.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## E﻿lise Marek - Promo\n\n<!--StartFragment-->\n\nHowdy, my name is Elise Marek and I am a Sophomore Accounting major from Spring, Texas! But most importantly, I am the loudest and the proudest member of the Fighting Texas Aggie Class of 2026 A-A-A-A-A. In my free time I enjoy going to concerts, working out, and spending time with my friends. My favorite Aggie Tradition is Muster because of how personal it became for me my freshmen and now sophomore year.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Bobby Casey - Promo\n\n<!--StartFragment-->\n\nHowdy, my name is Bobby Casey and I am a Sophomore Finance major from Houston Texas but more importantly I am the loudest and the proudest member of the Fighting Texas Aggie Class of 2026 A-A-A-A-A. In my free time I enjoy listening to music, working one cars, and playing video games. My favorite tradition is definitely muster because of how impactful and powerful the ceremony is.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Kenna Zeller - Service League\n\n<!--StartFragment-->\n\nHowdy y'all! My name is Kenna Zeller and I am a Class of ‘26 Biomedical Sciences major from Kingwood, Texas. I am hoping to pursue a career in nursing next fall. I am a Service League Co-Chair with my amazing partner Evan Lee. I enjoy playing all sports, music and anything outdoors. My favorite Aggie tradition is showing an unhinged amount of school spirit at any event (being totally Red Ass) and I can’t wait to share my love for tradition with the Class of ‘27.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## E﻿van Lee - Service League\n\n<!--StartFragment-->\n\nHowdy! My name is Evan Lee and I am a Class of ‘26 Agribusiness major from Kingwood, Texas. I am going into my sophomore year and hoping to pursue a career in mainly accounting and possibly law. I am a service league Co-Chair with my fantastic partner Kenna Zeller and I am so excited to help the Class of ‘27 have a great year. Some of my personal interests include country music, combat sports, sports in general, and weight lifting. My favorite Aggie tradition is midnight yell because of the atmosphere and the compassion it presents.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>"
}