{
  "title": "Our Staff",
  "content": "## Carter Kryzak -- Executive Director\n\nHowdy! My name is Carter Kryzak and I am a junior Mathematics and Economics major from Coppell, Texas, but more importantly, I am the loudest and the proudest member of the Fightin’ Texas Aggie class of 2023 (A-A-A WHOOP!). I have a passion for sports (especially Aggie basketball and baseball), and I enjoy playing ultimate frisbee and golf with my friends. My favorite Aggie tradition is saying “howdy!”\n\n## Megan Schlather -- Director of Communication and Administration\n\nHowdy! My name is Megan Schlather and I am Junior Ag Communication and Journalism major from College Station, Texas but more importantly I am THE LOUDEST and THE PROUDEST member of the Fightin’ Texas Aggie Class of 2023, A-A-A WHOOP! As a freshman in FEAST, I was in the promo committee and last year I was one of the Fundraising Co-Chairs. This year as the Assistant director, I am doing more of the external communications and administration things such as calendars and emails. FEAST gave me my everything at A&M. I am forever grateful for the ways that is has impacted me and it is a joy to give back even a small part of that to the class of 2024 last year and now the class of 2025. \n\n\n\n## Maddie Fritsch -- Director of Marketing and Outreach\n\n\n\n## Carter Brock -- Director of Finance\n\n\n\n## Macie Strong -- Functions\n\nHowdy! My name is Macie Strong and I’m a sophomore industrial distribution major from The Woodlands, Texas; but more importantly I’m definitely the loudest and proudest member of the Fightin’ Texas Aggie class of 2024 (A-A-A-A-A!). Some of my favorite things are adventuring with friends, going to spin class, and singing karaoke. I can’t wait to spend the year making memories and sharing the awesome traditions of A&M with the class of 2025!\n\n\n\n## Bobby Boyd -- Functions\n\nMy name is Bobby Boyd and I am a sophomore Business Honors and Finance major from Frisco, Texas; but more importantly, I am the loudest and the proudest member of the Fightin Texas Aggie class of 2024 (A-A-A-A-A!). I enjoy spending time outdoors hiking, fishing and playing beach volleyball or spikeball. I can’t wait to show the class of 2025 all the traditions that make A&M so special!\n\n\n\n## Jessica Horton -- Fundraising\n\nHowdy! My name is Jessica Horton, and I am a sophomore management major from\n\nGoldthwaite, Texas (yeehaw)! If you know where that is, then I will be surprised. But, most\n\nimportantly, I am THE loudest and THE proudest member of the Fightin’ Texas Aggie class of\n\n2024, A-A-A-A-A! I love sports, especially baseball, and I am the #1 BIGGEST fan of Joey Gallo. You can catch me waking up early to do some CrossFit, drinking Coke Zero, or talking about how much I love creamy jalapeno sauce from Chuy’s. My favorite TAMU tradition is the Aggie Ring. So, don’t be surprised if you hear me talking about how bad I want mine. I can’t wait to meet TAMU 2025, and I am so excited to welcome y’all to Texas A&M. Gig ‘Em!\n\n\n\n## Hayden Hall -- Fundraising\n\nHowdy! My name is Hayden Hall, and I am a sophomore accounting major from Midland, Texas. But more importantly, I am the loudest and the proudest member of the Fightin' Texas Aggie class of 2024,  A-A-A-A-A. A few things about me are that I am a Phoenix Suns fan (please don't mention the Finals), I have a dog named Bear who I do basically everything with, and I love to do crossfit in my free time. As far as Aggie traditions go, my favorite by far is Midnight Yell.\n\n\n\n## Cammy Pittman -- 12th Man\n\n\n\n## Rufus Tadpatri -- 12th Man\n\nHowdy, my name is Rufus Tadpatri, and I am an Electrical Engineering Major from Southlake, TX. But more importantly, I am the LOUDEST AND PROUDEST MEMBER OF THE FIGHTIN’ TEXAS AGGIE CLASS OF 2024 A-A-A-A-A! I’m a big fan of all Dallas sports teams (the Cowboys will win the Super Bowl this year), and, in my free time I enjoy playing football, basketball, and spikeball. My favorite Aggie tradition is Midnight Yell.\n\n\n\n## Autumn Fairchild -- Outreach\n\nHowdy my name is Autumn Fairchild and I am a sophomore bioenvironmental science major from Boerne, TX; but more importantly I am the loudest and proudest member of the Fightin Texas Aggie class of 2024 A-A-A-A-A! I love road trips, nature, midnight dance parties, and one direction!!! I have found my home in the aggie family and I cant wait to share our traditions with the class of 2025!!\n\n\n\n## Connor Zuspan -- Outreach\n\nMy name is Connor Zuspan. I am a sophomore engineering major from The Woodlands, Texas, and I am a part of the Fightin’ Texas Aggie class of 2024 (A-A-A-A-A). I have a passion for the outdoors, and I love going on adventures that typically include hiking, mountain biking, and rock climbing. Tradition is huge at Texas A&M, and you’ll never catch me start a conversation with anything other than “Howdy!”\n\n\n\n## Sydney McCorkle -- Service League\n\nHey y’all!! My name is Sydney McCorkle and I am a sophomore Accounting major from College Station, TX (yes I’m from here)!! Most of the time you’ll find me buying things I don’t need online, working out, or watching Alisha Marie and Kenzie Elizabeth on YouTube!! FEAST really encouraged me to participate and understand the many traditions that A&M has and I can’t wait to share them with the class of 2025!!\n\n\n\n## Logan Sandidge -- Service League\n\nMy name is Logan Sandidge and I’m a sophomore mechanical engineering major from Boerne, Texas. I like to ski, golf, and swim; I LOVE Aggie sports (especially football) and my favorite place in the world is Kyle field. When I’m not playing intramural sports or attempting to raise animals (ask about my fish and chickens) I like to make midnight drives to Buccees. FEAST taught me a ton about Aggie traditions and I can’t wait to share that with the class of 2025!\n\n\n\n## Marin Elliott -- Leadership\n\nHowdy! My name is Marin Elliott and I am a sophomore Materials Science & Engineering Major from Woodbury, Minnesota (which means I HATE Wisconsin \\[bob sad]). I am the leadership co-chair. You can catch me at the nearest Starbucks getting iced tea or country dancing at Hurricane Harry’s! I love Asian food, especially the sushi at Naked Fish! As a first-generation Aggie, I love all the traditions at A&M and I can’t wait to help the class of ’25 experience them!\n\n\n\n## Dakota Crist -- Leadership\n\n\n\n## Gabi Harvatin -- Promo\n\nHowdy my name is Gabi Harvatin and I am a sophomore finance major from Allen, Texas but more importantly I am THE loudest and THE proudest member of the fightin’ Texas Aggie class of 2023 (A-A-A-A-A).  I love coffee and sushi (not at the same time) and also love playing any sport.  I am a first-generation Aggie so FEAST really helped me learn about the campus traditions and find amazing friends.  I can’t wait to meet the class of 2025!!\n\n\n\n## Mac McCulla -- Promo\n\nHowdy! My name is Mac McCulla and I am a sophomore civil engineering major from New Orleans, Louisiana but more importantly I am the LOUDEST and the PROUDEST member of the fightin’ Texas Aggie Class of 2024 (A-A-A-A-Aaaaa)! I am a co-chair for the promo committee. I like watching the Dodgers play baseball and hanging out with my roommates (one of whom was also in FEAST). My favorite place to eat in town is Tanaka Ramen. I am fourth generation Aggie and I enjoy going to all Aggie sporting events. I can’t wait to meet the class of 2025 and get to make some cool merch for the upcoming FEAST year."
}