{
  "title": "Our Staff",
  "content": "<div class=\"bio\">\n<div class=\"paragr\">\n\n## Landry Langley - Executive Director\n\n<!--StartFragment-->\n\nHowdy! My name is Landry Langley and this is my bio!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0711.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Andrew Parker - Director of Engagement\n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0731.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Oliver Kennedy - Director of Finance\n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0727.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Ella Sanders - Director of Marketing\n\n<!--StartFragment-->\n\nc﻿oming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0719.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Allison Boyd - Director of Communications\n\n<!--StartFragment-->\n\nc﻿oming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0725.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Alanna Strittmatter - 12th Man\n\n<!--StartFragment-->\n\nHowdy! My name is Alanna Strittmatter and I am a sophomore Motor Behavior Kinesiology major from Prosper, Texas! But more importantly, I am the loudest and proudest member of the Fighting Texas Aggie Class of 2027. In my free time I enjoy playing volleyball or pickleball, grabbing a sweet treat, and hanging out with friends. My favorite A&M tradition is Fish Camp, because it introduced me to the Aggie Family and gave me the opportunity to make so many new friends.\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0661.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Dylan Brunner - 12th Man\n\n<!--StartFragment-->\n\nHowdy! My name is Dylan Brunner and I am a sophomore Mechanical & Manufacturing Engineering Technology major from The Woodlands, Texas. But most importantly, I am the loudest and the proudest member of the Fighting Texas Aggie Class of 2027(A-A-A-A-A). In my free time I enjoy playing intramural sports, building legos, playing rocket league, and … My favorite A&M tradition is Bonfire Remembrance, because it is such a surreal experience standing by the memorial at 2:42am with your fellow aggies to honor the 12 that passed away that day.\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0696.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Chelsea Hull - Functions\n\n<!--StartFragment-->\n\nHowdy my name is Chelsea Hull, I am a communication major from San Antonio, TX but more importantly I am the loudest and the proudest member of the fightin Texas Aggie class of 2027 (A-A-A-A-A). I love scuba diving, working out, and country music! My favorite A&M tradition is Fish Camp because it introduces new Aggies to the traditions and family they’ll find in Aggieland!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0671.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Jackson Hurd - Functions\n\n<!--StartFragment-->\n\nHowdy! My name is Jackson Hurd and I am an Accounting major from Arlington, Texas, but most importantly, I am THE loudest and THE proudest member of the Fighting Texas Aggie Class of 2027, A-A-A-A-A!!!!! I am an avid rap, r&b, and country music listener. In my free time I love to go to the gym and grill for my friends and family. My favorite Aggie tradition is Silver Taps. This is tradition is profoundly solemn, it is definitely a required experience to have while you’re at Texas A&M.\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0684.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Olivia Vaughn - Fundraising\n\n<!--StartFragment-->\n\nHowdy! My name is Olivia Vaughn and I am a sophomore Neuroscience major from San Antonio, Texas. But more importantly I am the loudest and the proudest member of the Fightin’ Texas Aggie Class of 2027 (A-A-A-A-A). A few of my favorite things are Costco hotdogs, going to the gym, the beach, fishing, and playing pickleball. My favorite tradition at Texas A&M is Silver Taps because its shows the camaraderie that unites Texas A&M and shows respect to our fallen.\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0636.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Cooper Stanford - Fundraising\n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0641.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Clare Hivnor - Leadership\n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0628.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Alex Pruitt - Leadership\n\n<!--StartFragment-->\n\nHowdy! My name is Alex Pruitt and I am biomedical science from San Antonio, Texas but most importantly I am the loudest and the proudest member of the fighting Texas Aggie class of 2027 (A-A-A-A-A). I enjoy working out and hanging out with friends. My favorite tradition is bonfire because it’s a really unifying and unique experience only found at Texas A&M. \n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0624.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Peyton Yon - Outreach\n\n<!--StartFragment-->\n\nc﻿oming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0655.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Juan Marcos Palomo - Outreach\n\n<!--StartFragment-->\n\nHOWDY! My name is JuanMarcos Palomo and I am a Sports Management major from Connecticut. But most importantly, I am the loudest and proudest member of the Fightin Texas Aggie Class of 2027, A-A-A-A-A! I like to play sports like football, soccer, and baseball. I’m a huge fan of all types of music, grilling burgers on a Saturday afternoon, and getting sweet treats! My favorite tradition is being a member of the 12th Man, I love to watch Aggie sports and will root for them no matter what! I’m so excited to have Freshman of my own and create amazing memories with all of them! I CANT WAIT!!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0676.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Ashlyn Pesek - Promo\n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0691.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Ty Blair - Promo\n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0702.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Emery Selner - Service League\n\n<!--StartFragment-->\n\nHowdy! My name is Emery Selner and I am a Geographic Information Science major from Plano, Texas, as well as a sophomore member of the Texas A&M class of 2027 (A-A-A-A-A)! I love hanging out with friends, playing soccer, and going on way too many ice cream runs! My favorite tradition is attending football games with the 12th man because the exciting energy and Aggie spirit in Kyle Field is unmatched. I can’t wait to watch plenty of Aggie football and have the best time in Feast this year!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0648.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Alex Molnar - Service League\n\n<!--StartFragment-->\n\nHowdy my name is Alex Molnar and I am an Accounting major. I am from Tomball, Texas but most importantly, I am the loudest and proudest member of the fightin Texas Aggies Class of 2027, A-A-A-A-A! I love my friends, family, dog, and to be outdoors. You’ll probably find me on the pickle ball court taking down the competition. My favorite tradition is midnight yell because it gets everyone hype for the game! BTHO Everyone!!!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/dsc_0642.jpeg)\n\n</div>"
}