{
  "title": "Our Staff",
  "content": "<div class=\"bio\">\n<div class=\"paragr\">\n\n## Landry Langley - Executive Director\n\n<!--StartFragment-->\n\nHowdy! My name is Landry Langley and this is my bio!\n\n<!--EndFragment-->\n\n</div>\n\n![](/images/uploads/img_1527.jpeg)\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Andrew Parker - Director of Engagement \n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Oliver Kennedy - Director of Finance \n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Ella Sanders - Director of Marketing \n\n<!--StartFragment-->\n\nc﻿oming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Alanna Strittmatter - 12th Man \n\n<!--StartFragment-->\n\nHowdy! My name is Alanna Strittmatter and I am a sophomore Motor Behavior Kinesiology major from Prosper, Texas! But more importantly, I am the loudest and proudest member of the Fighting Texas Aggie Class of 2027. In my free time I enjoy playing volleyball or pickleball, grabbing a sweet treat, and hanging out with friends. My favorite A&M tradition is Fish Camp, because it introduced me to the Aggie Family and gave me the opportunity to make so many new friends.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Dylan Brunner - 12th Man \n\n<!--StartFragment-->\n\nHowdy! My name is Dylan Brunner and I am a sophomore Mechanical & Manufacturing Engineering Technology major from The Woodlands, Texas. But most importantly, I am the loudest and the proudest member of the Fighting Texas Aggie Class of 2027(A-A-A-A-A). In my free time I enjoy playing intramural sports, building legos, playing rocket league, and … My favorite A&M tradition is Bonfire Remembrance, because it is such a surreal experience standing by the memorial at 2:42am with your fellow aggies to honor the 12 that passed away that day.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Chelsea Hull - Functions \n\n<!--StartFragment-->\n\nHowdy my name is Chelsea Hull, I am a communication major from San Antonio, TX but more importantly I am the loudest and the proudest member of the fightin Texas Aggie class of 2027 (A-A-A-A-A). I love scuba diving, working out, and country music! My favorite A&M tradition is Fish Camp because it introduces new Aggies to the traditions and family they’ll find in Aggieland!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Jackson Hurd - Functions \n\n<!--StartFragment-->\n\nHowdy! My name is Jackson Hurd and I am an Accounting major from Arlington, Texas, but most importantly, I am THE loudest and THE proudest member of the Fighting Texas Aggie Class of 2027, A-A-A-A-A!!!!! I am an avid rap, r&b, and country music listener. In my free time I love to go to the gym and grill for my friends and family. My favorite Aggie tradition is Silver Taps. This is tradition is profoundly solemn, it is definitely a required experience to have while you’re at Texas A&M.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Olivia Vaughn - Fundraising \n\n<!--StartFragment-->\n\nHowdy! My name is Olivia Vaughn and I am a sophomore Neuroscience major from San Antonio, Texas. But more importantly I am the loudest and the proudest member of the Fightin’ Texas Aggie Class of 2027 (A-A-A-A-A). A few of my favorite things are Costco hotdogs, going to the gym, the beach, fishing, and playing pickleball. My favorite tradition at Texas A&M is Silver Taps because its shows the camaraderie that unites Texas A&M and shows respect to our fallen.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Cooper Stanford - Fundraising \n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Clare Hivnor - Leadership\n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Alex Pruitt - Leadership \n\n<!--StartFragment-->\n\ncoming soon!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Peyton Yon - Outreach \n\n<!--StartFragment-->\n\nc﻿oming soon!\n\nHowdy my name is Grace Le and I am a Sophomore Neuroscience major from Plano, Texas, but most importantly I am the loudest and proudest member of the Fighting Texas Aggie Class of 2026. My favorite hobbies include playing sports like pickleball and volleyball, late night study sessions at Evans library, and trying out new food. Go check out my food review instagram account @goodlookineatss. My favorite tradition here at A&M would have to be Silver Taps because I love the idea of honoring the fallen Aggies of the month and being able to support their friends and family.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Juan Marcos Palomo - Outreach \n\n<!--StartFragment-->\n\nHOWDY! My name is JuanMarcos Palomo and I am a Sports Management major from Connecticut. But most importantly, I am the loudest and proudest member of the Fightin Texas Aggie Class of 2027, A-A-A-A-A! I like to play sports like football, soccer, and baseball. I’m a huge fan of all types of music, grilling burgers on a Saturday afternoon, and getting sweet treats! My favorite tradition is being a member of the 12th Man, I love to watch Aggie sports and will root for them no matter what! I’m so excited to have Freshman of my own and create amazing memories with all of them! I CANT WAIT!!\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## E﻿lise Marek - Promo\n\n<!--StartFragment-->\n\nHowdy, my name is Elise Marek and I am a Sophomore Accounting major from Spring, Texas! But most importantly, I am the loudest and the proudest member of the Fighting Texas Aggie Class of 2026 A-A-A-A-A. In my free time I enjoy going to concerts, working out, and spending time with my friends. My favorite Aggie Tradition is Muster because of how personal it became for me my freshmen and now sophomore year.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Bobby Casey - Promo\n\n<!--StartFragment-->\n\nHowdy, my name is Bobby Casey and I am a Sophomore Finance major from Houston Texas but more importantly I am the loudest and the proudest member of the Fighting Texas Aggie Class of 2026 A-A-A-A-A. In my free time I enjoy listening to music, working one cars, and playing video games. My favorite tradition is definitely muster because of how impactful and powerful the ceremony is.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## Kenna Zeller - Service League\n\n<!--StartFragment-->\n\nHowdy y'all! My name is Kenna Zeller and I am a Class of ‘26 Biomedical Sciences major from Kingwood, Texas. I am hoping to pursue a career in nursing next fall. I am a Service League Co-Chair with my amazing partner Evan Lee. I enjoy playing all sports, music and anything outdoors. My favorite Aggie tradition is showing an unhinged amount of school spirit at any event (being totally Red Ass) and I can’t wait to share my love for tradition with the Class of ‘27.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>\n\n<div class=\"bio\">\n<div class=\"paragr\">\n\n## E﻿van Lee - Service League\n\n<!--StartFragment-->\n\nHowdy! My name is Evan Lee and I am a Class of ‘26 Agribusiness major from Kingwood, Texas. I am going into my sophomore year and hoping to pursue a career in mainly accounting and possibly law. I am a service league Co-Chair with my fantastic partner Kenna Zeller and I am so excited to help the Class of ‘27 have a great year. Some of my personal interests include country music, combat sports, sports in general, and weight lifting. My favorite Aggie tradition is midnight yell because of the atmosphere and the compassion it presents.\n\n<!--EndFragment-->\n\n</div>\n\n![]()\n\n</div>"
}